In [1]:
import sqlite3 as sql
import pandas as pd
sql.sqlite_version

'3.35.5'

In [2]:
db=sql.connect("c-Movies.db")

In [3]:
cursor=db.cursor()
cursor.execute('''CREATE TABLE Movies(id INTEGER PRIMARY KEY AUTOINCREMENT,Movie_Name TEXT,Actor TEXT,
Actress TEXT,Director TEXT,Release_Date TEXT)''')

In [4]:
cursor.execute('''INSERT INTO Movies(Movie_Name,Actor,Actress,Director,Release_date)VALUES(?,?,?,?,?)''',
               ("SARKARU VAARI PAATA","MAHESH BABU","KEERTHY SURESH","PARASURAM","12-05-2022"))
cursor.execute('''INSERT INTO Movies(Movie_Name,Actor,Actress,Director,Release_date)VALUES(?,?,?,?,?)''',
               ("RADHE SHYAM","PRABHAS","POOJA HEGDE","KUMAR","11-03-2022"))

In [5]:
cursor.close()
db.commit()

In [6]:
df=pd.read_sql_query("SELECT * FROM Movies",db)
df

,id,Movie_Name,Actor,Actress,Director,Release_Date
0,1,SARKARU VAARI PAATA,MAHESH BABU,KEERTHY SURESH,PARASURAM,12-05-2022
1,2,RADHE SHYAM,PRABHAS,POOJA HEGDE,KUMAR,11-03-2022

In [7]:
df=pd.read_sql_query("SELECT Movie_Name FROM Movies",db)
df

            Movie_Name
0  SARKARU VAARI PAATA
1          RADHE SHYAM

In [8]:
df=pd.read_sql_query("SELECT Actor FROM Movies",db)
df

         Actor
0  MAHESH BABU
1      PRABHAS

In [9]:
df=pd.read_sql_query("SELECT Actress FROM Movies",db)
df

          Actress
0  KEERTHY SURESH
1     POOJA HEGDE

In [10]:
df=pd.read_sql_query("SELECT Director FROM Movies",db)
df

    Director
0  PARASURAM
1      KUMAR

In [11]:
df=pd.read_sql_query("SELECT Release_Date FROM Movies",db)
df

  Release_Date
0   12-05-2022
1   11-03-2022

In [83]:
db.close()